<?php
header('Content-Type: text/html; charset=utf-8');
include __DIR__.'/lib/functions.php';
include __DIR__.'/lib/iso8859_ksc5601_mapping.php';


/*
 * 테스트용 문자열
 * 정상 문자열과 비정상 문자열로 구분해서 테스트
 * 실제 사용에서는 비정상 확인 부분 코드만 사용하면 됨
*/
$lines = [];

$lines['valid'][] = "가나·다라123asB";
$lines['valid'][] = '"9","07a641734df5421a03ae17bb9357","58ad3c75bedf3d","","","{ "p_no" : "690030" , "p_name" : "군산 나운동 모델하우스 알바모집" , "cate1" : "04000000_서비스" , "cate2" : "04020000_부동산" , "cate3" : "0402A007_분양" , "cate4" : "전북|군산시|나운동" , "platform" : "pc" , "referrer" : "" }","2017-03-10 12:59:56"';
$lines['valid'][] = '"8","3d8c0e94b92aca663b42f746f7be","58ad3c75bedf3d","","","{ "p_no" : "773402" , "p_name" : "스크린골프알바구함토요일만" , "cate1" : "04000000_서비스" , "cate2" : "04070000_골프캐디" , "cate3" : "0407B002_스크린골프" , "cate4" : "전북|전주시 완산구|효자동3가" , "platform" : "mobile_app" , "referrer" : "" }","2017-03-10 12:59:57"';

$lines['invalid'][] = 'ºÎ»êÀü´ÜÁö ¹èÆ÷»ç¿ø ¸ðÁý.  2¿ù6ÀÏºÎÅÍ ¤ý»ó¼¼³»¿ëÈ®ÀÎ';
$lines['invalid'][] = '"0","3c4cc436fa2cb1b2fe7240429dec","58ad3c75bedf3d","","","{ "p_no" : "760429" , "p_name" : "¼³Ä¡±â»ç ÀüÀÚÁ¦Ç°¼³Ä¡ ¸ðÁý/¿ëÀÎ½Ã Ã³ÀÎ±¸ Áö¿ª" , "cate1" : "05000000_»ý»ê¡¤±â´É¡¤¿îÀü¡¤¹è´Þ" , "cate2" : "05080000_¿îÀüÁ÷|05090000_Äü¼­ºñ½º¡¤ÅÃ¹è|05220000_Àü±â°ø»ç¡¤¼³Ä¡" , "cate3" : "0508A002_¿îÀü|0509A001_¹è¼Û|0509A002_¹è´Þ|0522A001_¼³ºñ|0522A004_¹è¼±|0522A006_¿¡¾îÄÁ¼³Ä¡|0522A007_ÀÎÅÍ³Ý¼³Ä¡|0522A008_°¡Àü¼³Ä¡" , "cate4" : "°æ±â|¿ëÀÎ½Ã Ã³ÀÎ±¸|¸ðÇö¸é" , "platform" : "pc" , "referrer" : "https://search.naver.com/search.naver?where=webkr&sm=tab_jum&ie=utf8&query=%EB%AA%A8%ED%98%84%EB%A9%B4%EC%9D%B8%ED%84%B0%EB%84%B7%EC%84%A4%EC%B9%98" }","2017-03-10 12:42:09"';
$lines['invalid'][] = '"7","d69bcc20f2e32bcf7d6e1d58ae87","58ad3c75bedf3d","","","{ "p_no" : "759220" , "p_name" : "¼³Ä¡±â»ç ÀüÀÚÁ¦Ç°¼³Ä¡ ¸ðÁý/¿ëÀÎ½Ã Ã³ÀÎ±¸ Áö¿ª" , "cate1" : "05000000_»ý»ê¡¤±â´É¡¤¿îÀü¡¤¹è´Þ" , "cate2" : "05080000_¿îÀüÁ÷|05090000_Äü¼­ºñ½º¡¤ÅÃ¹è|05220000_Àü±â°ø»ç¡¤¼³Ä¡" , "cate3" : "0508A002_¿îÀü|0509A001_¹è¼Û|0509A002_¹è´Þ|0522A001_¼³ºñ|0522A004_¹è¼±|0522A006_¿¡¾îÄÁ¼³Ä¡|0522A007_ÀÎÅÍ³Ý¼³Ä¡|0522A008_°¡Àü¼³Ä¡" , "cate4" : "°æ±â|¿ëÀÎ½Ã Ã³ÀÎ±¸|¸ðÇö¸é" , "platform" : "pc" , "referrer" : "https://search.naver.com/search.naver?where=webkr&sm=tab_jum&ie=utf8&query=%EB%AA%A8%ED%98%84%EB%A9%B4%EC%9D%B8%ED%84%B0%EB%84%B7%EC%84%A4%EC%B9%98" }","2017-03-10 12:42:07"';


/*
 * 확인할 패턴 : 필요시 추가
 * 
 * \x{3008}-\x{301b} : 〈〉《》「」『』【】〒〓〔〕〖〗〘〙〚〛
 * \x{2605}-\x{2606} : ★☆
 * \x{3131}-\x{3163} : 한글 자음, 모음
 * \x{ac00}-\x{d7a3} : 한글(고어제외)
 */ 
$pattern = '/[^';	//패턴 시작
$pattern .= ' \'\/~`\!@#\$%\^&\*\(\)_\-\+=\{\}\[\]\|;:"\<\>,\.\?\\';	//일반 특수문자
$pattern .= 'a-zA-Z0-9';	//알파벳, 숫자
$pattern .= '·';	//희귀 특수문자
$pattern .= '\x{3008}-\x{301b}\x{2605}-\x{2606}';	//희귀 특수문자, 괄호 등
$pattern .= '\x{3131}-\x{3163}\x{ac00}-\x{d7a3}';	//한글
$pattern .= ']/u';	//패턴 종료



//정상 스트링이 제대로 체크되는지 확인
foreach($lines['valid'] as $key => $line) {
	//한글이 포함 안된 경우만 체크
	if(!preg_match('/[가-힣]/u', $line)) {
		//한글/특수문자 이외의 글자가 쓰인 경우 체크
		if(preg_match($pattern, $line)) {
			echo "정상 스트링 [$key] : 체크 오류\n\n";
			echo $line."\n";
		} else {
			echo "정상 스트링 [$key] : 체크 정상\n\n";
		}
	} else {	//한글 포함
		echo "정상 스트링 [$key] : 체크 정상\n\n";
	}
}

/*
 * 비정상 스트링을 제대로 잡아내는지 확인
 * 1. 한글 포함 여부만 확인 : 스트링 내에서 한글이 깨지면 전부 깨지거나 전부 안깨지거나.. 둘 중 하나이므로 깨질 경우만 체크
 * 2. 한글이 없으면 정말 한글이 없는 건지, 아니면 깨진건지 확인
 * 3.깨진거면 매핑테이블을 이용해 변환
*/
foreach($lines['invalid'] as $key => $line) {
	
	//한글이 포함 안된 경우만 체크
	if(!preg_match('/[가-힣]/u', $line)) {
		
		//한글/특수문자 이외의 글자가 쓰인 경우 체크
		if(preg_match($pattern, $line)) {
			echo "비정상 스트링 [$key] : 확인 완료";
			
			$correct_str = correct_broken_korean($pattern, $iso8859_ksc5601_map, $line);
			print_r($correct_str);
			echo "\n\n";
			
		} else {	//한글 포함
			echo "비정상 스트링 [$key] : 체크 오류\n\n";
		}
	}
	
}

